Masmiseim36/nxpSDK/devices/MIMXRT798S/MIMXRT798S_cm33_core0.xml
        <register>
          <name>PRSTCTL3</name>
          <description>Compute Domain Peripheral Reset Control 3</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xCFE7EFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LP_FLEXCOMM2</name>
              <description>LP_FLEXCOMM2 Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LP_FLEXCOMM2_SET</name>
                  <description>Clears reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LP_FLEXCOMM2_CLR</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM3</name>
              <description>LP_FLEXCOMM3 Reset</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LP_FLEXCOMM3_SET</name>
                  <description>Clears reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LP_FLEXCOMM3_CLR</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM4</name>
              <description>LP_FLEXCOMM4 Reset</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LP_FLEXCOMM4_SET</name>
                  <description>Clears reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LP_FLEXCOMM4_CLR</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM5</name>
              <description>LP_FLEXCOMM5 Reset</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LP_FLEXCOMM5_SET</name>
                  <description>Clears reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LP_FLEXCOMM5_CLR</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM6</name>
              <description>LP_FLEXCOMM6 Reset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LP_FLEXCOMM6_SET</name>
                  <description>Clears reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LP_FLEXCOMM6_CLR</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM7</name>
              <description>LP_FLEXCOMM7 Reset</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LP_FLEXCOMM7_SET</name>
                  <description>Clears reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LP_FLEXCOMM7_CLR</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM8</name>
              <description>LP_FLEXCOMM8 Reset</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LP_FLEXCOMM8_SET</name>
                  <description>Clears reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LP_FLEXCOMM8_CLR</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM9</name>
              <description>LP_FLEXCOMM9 Reset</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LP_FLEXCOMM9_SET</name>
                  <description>Clears reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LP_FLEXCOMM9_CLR</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM10</name>
              <description>LP_FLEXCOMM10 Reset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LP_FLEXCOMM10_SET</name>
                  <description>Clears reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LP_FLEXCOMM10_CLR</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM11</name>
              <description>LP_FLEXCOMM11 Reset</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LP_FLEXCOMM11_SET</name>
                  <description>Clears reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LP_FLEXCOMM11_CLR</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM12</name>
              <description>LP_FLEXCOMM12 Reset</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LP_FLEXCOMM12_SET</name>
                  <description>Clears reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LP_FLEXCOMM12_CLR</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM13</name>
              <description>LP_FLEXCOMM13 Reset</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LP_FLEXCOMM13_SET</name>
                  <description>Clears reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LP_FLEXCOMM13_CLR</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAI0</name>
              <description>SAI0 Reset</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SAI0_SET</name>
                  <description>Clears reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAI0_CLR</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAI1</name>
              <description>SAI1 Reset</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SAI1_SET</name>
                  <description>Clears reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAI1_CLR</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAI2</name>
              <description>SAI2 Reset</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SAI2_SET</name>
                  <description>Clears reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAI3_CLR</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I3C0</name>
              <description>I3C0 Reset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>I3C0_SET</name>
                  <description>Clears reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I3C0_CLR</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I3C1</name>
              <description>I3C1 Reset</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>I3C1_SET</name>
                  <description>Clears reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I3C1_CLR</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRC0</name>
              <description>CRC0 Reset</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRC0_SET</name>
                  <description>Clears reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC0_CLR</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTIMER0</name>
              <description>CTIMER0 Reset</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CTIMER0_SET</name>
                  <description>Clears reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTIMER0_CLR</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTIMER1</name>
              <description>CTIMER1 Reset</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CTIMER1_SET</name>
                  <description>Clears reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTIMER1_CLR</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTIMER2</name>
              <description>CTIMER2 Reset</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CTIMER2_SET</name>
                  <description>Clears reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTIMER2_CLR</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTIMER3</name>
              <description>CTIMER3 Reset</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CTIMER3_SET</name>
                  <description>Clears reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTIMER3_CLR</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTIMER4</name>
              <description>CTIMER4 Reset</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CTIMER4_SET</name>
                  <description>Clears reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTIMER4_CLR</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MRT0</name>
              <description>MRT0 Reset</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MRT0_SET</name>
                  <description>Clears reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MRT0_CLR</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UTICK0</name>
              <description>UTICK0 Reset</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UTICK0_SET</name>
                  <description>Clears reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UTICK0_CLR</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEMA42_4</name>
              <description>SEMA42_4 Reset</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEMA42_4_SET</name>
                  <description>Clears reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEMA42_4_CLR</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MU4</name>
              <description>MU4 Reset</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MU4_SET</name>
                  <description>Clears reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MU4_CLR</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
