Masmiseim36/nxpSDK/devices/MIMXRT798S/MIMXRT798S_cm33_core0.xml
        <register>
          <name>ELS_TEMPORAL_STATE</name>
          <description>ELS Temporal State</description>
          <addressOffset>0xB08</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TEMPORAL_STATE</name>
              <description>Temporal State</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELS_KDF_MASK</name>
          <description>Key Derivation Function Mask</description>
          <addressOffset>0xB0C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KDF_MASK</name>
              <description>Key Derivation Function Mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELS_BOOT_STATE0</name>
          <description>ELS Boot State 0</description>
          <addressOffset>0xB38</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BOOT_SRC</name>
              <description>Boot Image Source</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XSPI_NOR0</name>
                  <description>XSPI NOR instance 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XSPI_NOR1</name>
                  <description>XSPI NOR instance 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>eMMC0</name>
                  <description>eMMC instance 0</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>eMMC1</name>
                  <description>eMMC instance 1</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REC</name>
                  <description>Recovery SPI flash image</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SERIAL</name>
                  <description>Serial boot image (execute ISP command used)</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XSPI_NAND0</name>
                  <description>XSPI NAND instance 0</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XSPI_NAND1</name>
                  <description>XSPI NAND instance 1</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SB_JUMP</name>
              <description>SB3 Containing SB_JUMP Command</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FAIL</name>
                  <description>Fail</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DONE</name>
                  <description>Success</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PSRAM</name>
              <description>Image XIP or Copy-to-PSRAM</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>PSRAM is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>PSRAM is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IMAGE_TYP</name>
              <description>Image Type</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ECDSA</name>
                  <description>Signed image (ECDSA)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC</name>
                  <description>CRC image (CRC)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SB3_IMAGE</name>
              <description>SB3 Image Receive</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FAIL</name>
                  <description>Fail</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DONE</name>
                  <description>Success</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CDI_DEV_KEY</name>
              <description>CDI Based Device Keys for CSR Harvesting</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FAIL</name>
                  <description>Fail</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DONE</name>
                  <description>CDI device keys derived</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CDI_COMP</name>
              <description>CDI per DICE Specification</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FAIL</name>
                  <description>Fail</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DONE</name>
                  <description>CDI compute done</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TZ_PRESET_DATA</name>
              <description>TrustZone Preset Data</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FAIL</name>
                  <description>Fail</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DONE</name>
                  <description>TrustZone preset data loaded</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEBUG_AUTH</name>
              <description>Debug Authentication</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FAIL</name>
                  <description>Fail</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DONE</name>
                  <description>Debug authentication done</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ITRC_ZEROIZE</name>
              <description>ITRC Zeroize Event</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FAIL</name>
                  <description>Fail</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DONE</name>
                  <description>ITRC zeroize done</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XSPI0_IPED_EN</name>
              <description>XSPI0 IPED Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XSPI1_IPED_EN</name>
              <description>XSPI1 IPED Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BOOT_PIN_STATE</name>
              <description>Boot Pin State</description>
              <bitOffset>22</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BP_0</name>
                  <description>kBootPinSrc_eMMC_uSDHC0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BP_1</name>
                  <description>kBootSrc_XSPI0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BP_2</name>
                  <description>kBootSrc_ISP_AUTO</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BP_3</name>
                  <description>kBootSrc_XSPI1</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BP_4</name>
                  <description>Boot pin not working</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DED_ERR_DET</name>
              <description>DED Error Detect</description>
              <bitOffset>25</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DED</name>
                  <description>Error detected</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_DED</name>
                  <description>No error</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ELS_BOOT_STATE1</name>
          <description>ELS Boot State 1</description>
          <addressOffset>0xB3C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ROOT_KEY_INDEX</name>
              <description>Root Key Index</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FIPS_SELF_TEST</name>
              <description>FIPS Self-Test</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIPS_SHA_STEN</name>
                  <description>FIPS_SHA_STEN</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIPS_AES_STEN</name>
                  <description>FIPS_AES_STEN</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIPS_ECDSA_STEN</name>
                  <description>FIPS_ECDSA_STEN</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIPS_DRBG_STEN</name>
                  <description>FIPS_DRBG_STEN</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIPS_HMAC_STEN</name>
                  <description>FIPS_HMAC_STEN</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIPS_CKDF_STEN</name>
                  <description>FIPS_CKDF_STEN</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIPS_HKDF_STEN</name>
                  <description>FIPS_HKDF_STEN</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SB3_TYP</name>
              <description>SB3 Type</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TYP_0</name>
                  <description>Customer firmware load and update file</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TYP_1</name>
                  <description>NXP provisioning firmware</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TYP_2</name>
                  <description>Customer manufacturing firmware (device HSM)</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PMC0_FLAGS_19_18</name>
              <description>PMC0.FLAGS[19:18]</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMC0_FLAGS_22_21</name>
              <description>PMC0.FLAGS[22:21]</description>
              <bitOffset>15</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMC0_FLAGS_17_16</name>
              <description>PMC0.FLAGS[17:16]</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELS_BOOT_STATE2</name>
          <description>ELS Boot State 2</description>
          <addressOffset>0xB40</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VDD_POR</name>
              <description>VDD POR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_RST</name>
                  <description>No reset event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RST</name>
                  <description>Reset event detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESETN_RST</name>
              <description>RESETN Reset</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_RST</name>
                  <description>No reset event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RST</name>
                  <description>Reset event detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISP_AP_RST</name>
              <description>ISP_AP Reset</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_RST</name>
                  <description>No reset event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RST</name>
                  <description>Reset event detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ITRC_SW_RST</name>
              <description>ITRC_SW Reset</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_RST</name>
                  <description>No reset event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RST</name>
                  <description>Reset event detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ELS_ASSET_PROT</name>
          <description>ELS Asset Protection</description>
          <addressOffset>0xB68</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ASSET_PROTECTION</name>
              <description>Asset Protection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_PROT</name>
                  <description>NOT protected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>ELS_AS_UUID[%s]</name>
          <description>ELS AS UUID</description>
          <addressOffset>0xBC0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>UUIDN</name>
              <description>UUIDn 32-Bit Data Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
