Masmiseim36/nxpSDK/devices/MIMXRT798S/MIMXRT798S_cm33_core0.xml
        <register>
          <name>OTP_SHADOW_PARTB443</name>
          <description>OTP shadow register</description>
          <addressOffset>0x6EC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB444</name>
          <description>OTP shadow register</description>
          <addressOffset>0x6F0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB445</name>
          <description>OTP shadow register</description>
          <addressOffset>0x6F4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB446</name>
          <description>OTP shadow register</description>
          <addressOffset>0x6F8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB447</name>
          <description>OTP shadow register</description>
          <addressOffset>0x6FC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB448</name>
          <description>OTP shadow register</description>
          <addressOffset>0x700</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB449</name>
          <description>OTP shadow register</description>
          <addressOffset>0x704</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB450</name>
          <description>OTP shadow register</description>
          <addressOffset>0x708</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB451</name>
          <description>OTP shadow register</description>
          <addressOffset>0x70C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB452</name>
          <description>OTP shadow register</description>
          <addressOffset>0x710</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB453</name>
          <description>OTP shadow register</description>
          <addressOffset>0x714</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB454</name>
          <description>OTP shadow register</description>
          <addressOffset>0x718</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB455</name>
          <description>OTP shadow register</description>
          <addressOffset>0x71C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB456</name>
          <description>OTP shadow register</description>
          <addressOffset>0x720</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB457</name>
          <description>OTP shadow register</description>
          <addressOffset>0x724</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB458</name>
          <description>OTP shadow register</description>
          <addressOffset>0x728</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB459</name>
          <description>OTP shadow register</description>
          <addressOffset>0x72C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB460</name>
          <description>OTP shadow register</description>
          <addressOffset>0x730</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB461</name>
          <description>OTP shadow register</description>
          <addressOffset>0x734</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB462</name>
          <description>OTP shadow register</description>
          <addressOffset>0x738</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB463</name>
          <description>OTP shadow register</description>
          <addressOffset>0x73C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB464</name>
          <description>OTP shadow register</description>
          <addressOffset>0x740</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB465</name>
          <description>OTP shadow register</description>
          <addressOffset>0x744</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB466</name>
          <description>OTP shadow register</description>
          <addressOffset>0x748</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB467</name>
          <description>OTP shadow register</description>
          <addressOffset>0x74C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB468</name>
          <description>OTP shadow register</description>
          <addressOffset>0x750</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB469</name>
          <description>OTP shadow register</description>
          <addressOffset>0x754</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB470</name>
          <description>OTP shadow register</description>
          <addressOffset>0x758</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB471</name>
          <description>OTP shadow register</description>
          <addressOffset>0x75C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB472</name>
          <description>OTP shadow register</description>
          <addressOffset>0x760</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB473</name>
          <description>OTP shadow register</description>
          <addressOffset>0x764</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB474</name>
          <description>OTP shadow register</description>
          <addressOffset>0x768</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB475</name>
          <description>OTP shadow register</description>
          <addressOffset>0x76C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB476</name>
          <description>OTP shadow register</description>
          <addressOffset>0x770</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
