Masmiseim36/nxpSDK/devices/MIMXRT798S/MIMXRT798S_cm33_core0.xml
        <register>
          <name>FRO2MAXDOMAINEN</name>
          <description>FRO2MAX Clock Domain Enable</description>
          <addressOffset>0x298</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FRO2MAX_OF_CMPT</name>
              <description>Enable fro2_max Clock Control of VDD2_COMP Domain</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRO2MAX_OF_CMPT_CLR</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRO2MAX_OF_CMPT_SET</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRO2MAX_OF_SENSE</name>
              <description>Enable fro2_max Clock Control of VDD1_SENSE Domain</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRO2MAX_OF_SENSE_CLR</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRO2MAX_OF_SENSE_SET</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRO2MAX_OF_VDD2_DSP</name>
              <description>Enable fro2_max Clock Control of VDD2_DSP Domain</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRO2MAX_OF_VDD2_DSP_CLR</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRO2MAX_OF_VDD2_DSP_SET</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRO2MAX_OF_MD2</name>
              <description>Enable fro2_max Clock Control of VDD2_MEDIA Domain</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRO2MAX_OF_MD2_CLR</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRO2MAX_OF_MD2_SET</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRO2MAX_OF_MDN</name>
              <description>Enable fro2_max Clock Control of VDDN_MEDIA Domain</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRO2MAX_OF_MDN_CLR</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRO2MAX_OF_MDN_SET</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRO2MAX_OF_VDD2_COM</name>
              <description>Enable fro2_max Clock Control of VDD2_COM Domain</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRO2MAX_OF_VDD2_COM_CLR</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRO2MAX_OF_VDD2_COM_SET</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRO2MAX_OF_COMN</name>
              <description>Enable fro2_max Clock Control of VDDN_COM Domain</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRO2MAX_OF_COMN_CLR</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRO2MAX_OF_COMN_SET</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SENSEMAINCLKDIV</name>
          <description>VDD1_SENSE Main Clock Divider</description>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIV</name>
              <description>Clock Divider Value Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUSY</name>
              <description>Busy Flag</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIVIDER_IS_NOT_BUSY</name>
                  <description>The CLKOUT is outputted with the new divider value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDER_IS_BUSY</name>
                  <description>A change is being made to the divider value.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REQFLAG</name>
              <description>Request Flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIVIDER_READY</name>
                  <description>The change to the divider value has been finished.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDER_NOT_READY</name>
                  <description>The change is being made to the divider value.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MAINCLKSEL</name>
          <description>VDD1_SENSE Main Clock Source Select</description>
          <addressOffset>0x434</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>VDD1_SENSE Main Clock Source Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>base_clk</name>
                  <description>baseclk_sense</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dfro2_max</name>
                  <description>fro2_max</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>audio_pll_pfd3</name>
                  <description>audio_pll_pfd3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dfro1_max</name>
                  <description>fro1_max</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SENSERAMCLKSEL</name>
          <description>VDD1_SENSE RAM Clock Source Select</description>
          <addressOffset>0x450</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>VDD1_SENSE RAM Clock Source Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>baseclk_sense</name>
                  <description>baseclk_sense</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dfro2_max</name>
                  <description>fro2_max</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>audio_pll_pfd2</name>
                  <description>audio_pll_pfd2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dfro1_max</name>
                  <description>fro1_max</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SENSERAMCLKDIV</name>
          <description>VDD1_SENSE RAM Clock Divider</description>
          <addressOffset>0x45C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIV</name>
              <description>Clock Divider Value Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUSY</name>
              <description>Busy Flag</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIVIDER_IS_NOT_BUSY</name>
                  <description>The CLKOUT is outputted with the new divider value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDER_IS_BUSY</name>
                  <description>A change is being made to the divider value.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REQFLAG</name>
              <description>Request Flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIVIDER_READY</name>
                  <description>The change to the divider value has been finished.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDER_NOT_READY</name>
                  <description>A change is being made to the divider value.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OSTIMERFCLKSEL</name>
          <description>OSTIMER Functional Clock Source Select</description>
          <addressOffset>0x480</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>Clock Source Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>baseclk_vdd1_sense</name>
                  <description>baseclk_sense</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wake32k_clk</name>
                  <description>wake32k_clk</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lposc_1m</name>
                  <description>1m_lposc</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>osc_clk</name>
                  <description>osc_clk</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEL_EN</name>
              <description>Clock MUX Output Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clk_sel_not_enable</name>
                  <description>Gates output of clock mux.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_sel_enable</name>
                  <description>Enables output of clock mux.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OSTIMERFCLKDIV</name>
          <description>OSTIMER Functional Clock Divider</description>
          <addressOffset>0x484</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x40000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIV</name>
              <description>Clock Divider Value Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUSY</name>
              <description>Busy Flag</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIVIDER_IS_NOT_BUSY</name>
                  <description>The CLKOUT is outputted with the new divider value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDER_IS_BUSY</name>
                  <description>A change is being made to the divider value.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESET</name>
              <description>Divider Counter Reset</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIVIDER_COUNTER_NO_EFFECT</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDER_COUNTER_RESET</name>
                  <description>Resets the divider counter.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HALT</name>
              <description>Divider Counter Halt</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIVIDER_COUNTER_NO_EFFECT</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDER_COUNTER_HALT</name>
                  <description>Halts (stops) the divider counter.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REQFLAG</name>
              <description>Request Flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REQFLAG_CHANGE_FINISHED</name>
                  <description>The divider change has been finished.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQFLAG_CHANGED</name>
                  <description>A change is being made to the divider value.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SDADCFCLKSEL</name>
          <description>SDADC Functional Clock Source Select</description>
          <addressOffset>0x600</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>SDADC Functional Clock Source Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>base_clk</name>
                  <description>baseclk_sense</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dfro2_div8</name>
                  <description>fro2_div8</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>audio_pll_vco</name>
                  <description>audio_pll_vco</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>audio_clk</name>
                  <description>audio_clk</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEL_EN</name>
              <description>Clock MUX Output Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clk_sel_not_enable</name>
                  <description>Gates output of clock mux.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_sel_enable</name>
                  <description>Enables output of clock mux.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
