Masmiseim36/nxpSDK/devices/MIMXRT798S/MIMXRT798S_cm33_core0.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>SYSCON2</name>
      <description>SYSCON2</description>
      <groupName>SYSCON2</groupName>
      <baseAddress>0x40066000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xFE8</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>GPR[%s]</name>
          <description>General Purpose Register n</description>
          <addressOffset>0xFE0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPR</name>
              <description>General Purpose Register Bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>RSTCTL2</name>
      <description>RSTCTL2</description>
      <groupName>RSTCTL2</groupName>
      <baseAddress>0x40067000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x74</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PRSTCTL0</name>
          <description>VDDN Domain Peripheral Reset Control 0</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IOPCTL2</name>
              <description>IOPCTL2 Reset</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IOPCTL2_CLR</name>
                  <description>Clears reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOPCTL2_SET</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PRSTCTL0_SET</name>
          <description>VDDN Domain Peripheral Reset Control 0 SET</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IOPCTL2</name>
              <description>IOPCTL2 Reset</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IOPCTL2_NO_EFFECT</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOPCTL2_SET</name>
                  <description>Sets reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PRSTCTL0_CLR</name>
          <description>VDDN Domain Peripheral Reset Control 0 CLR</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IOPCTL2</name>
              <description>IOPCTL2 Reset</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IOPCTL2_NO_EFFECT</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOPCTL2_CLR</name>
                  <description>Clears reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>RTC0</name>
      <description>Real Time Clock</description>
      <groupName>RTC</groupName>
      <baseAddress>0x40068000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x2A</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RTC0_ALARM</name>
        <value>26</value>
      </interrupt>
      <interrupt>
        <name>RTC0</name>
        <value>27</value>
      </interrupt>
      <registers>
        <register>
          <name>YEARMON</name>
          <description>Year and Month Counters</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>MON_CNT</name>
              <description>Month Counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ILLEGAL_VALUE_0</name>
                  <description>Illegal Value</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JANUARY</name>
                  <description>January</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FEBRUARY</name>
                  <description>February</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MARCH</name>
                  <description>March</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APRIL</name>
                  <description>April</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAY</name>
                  <description>May</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JUNE</name>
                  <description>June</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JULY</name>
                  <description>July</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUGUST</name>
                  <description>August</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEPTEMBER</name>
                  <description>September</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCTOBER</name>
                  <description>October</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOVEMBER</name>
                  <description>November</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DECEMBER</name>
                  <description>December</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ILLEGAL_VALUE_13</name>
                  <description>Illegal Value</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ILLEGAL_VALUE_14</name>
                  <description>Illegal Value</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ILLEGAL_VALUE_15</name>
                  <description>Illegal Value</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>YROFST</name>
              <description>Year Offset Count Value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DAYS</name>
          <description>Days and Day-of-Week Counters</description>
          <addressOffset>0x2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DAY_CNT</name>
              <description>Days Counter Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DOW</name>
              <description>Day of Week Counter Value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SUNDAY</name>
                  <description>Sunday</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MONDAY</name>
                  <description>Monday</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TUESDAY</name>
                  <description>Tuesday</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WEDNESDAY</name>
                  <description>Wednesday</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THURSDAY</name>
                  <description>Thursday</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRIDAY</name>
                  <description>Friday</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SATURDAY</name>
                  <description>Saturday</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HOURMIN</name>
          <description>Hours and Minutes Counters</description>
          <addressOffset>0x4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>MIN_CNT</name>
              <description>Minutes Counter Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HOUR_CNT</name>
              <description>Hours Counter Value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SECONDS</name>
          <description>Seconds Counters</description>
          <addressOffset>0x6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>SEC_CNT</name>
              <description>Seconds Counter Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ALM_YEARMON</name>
          <description>Year and Months Alarm</description>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ALM_MON</name>
              <description>Months Value for Alarm</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALM_YEAR</name>
              <description>Year Value for Alarm</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ALM_DAYS</name>
          <description>Days Alarm</description>
          <addressOffset>0xA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ALM_DAY</name>
              <description>Days Value for Alarm</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ALM_HOURMIN</name>
          <description>Hours and Minutes Alarm</description>
          <addressOffset>0xC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ALM_MIN</name>
              <description>Minutes Value for Alarm</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALM_HOUR</name>
              <description>Hours Value for Alarm</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ALM_SECONDS</name>
          <description>Seconds Alarm</description>
          <addressOffset>0xE</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ALM_SEC</name>
              <description>Seconds Alarm Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEC_SEC</name>
              <description>Decrement Seconds Counter by 1.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INC_SEC</name>
              <description>Increment Seconds Counter by 1.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <description>Control</description>
          <addressOffset>0x10</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x200</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>FINEEN</name>
              <description>Fine Compensation Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Fine compensation is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Fine compensation is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP_EN</name>
              <description>Compensation Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Coarse compensation is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Coarse compensation is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALM_MATCH</name>
              <description>Alarm Match</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HOURS</name>
                  <description>Only seconds, minutes, and hours matched.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAYS</name>
                  <description>Only seconds, minutes, hours, and days matched.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MONTHS</name>
                  <description>Only seconds, minutes, hours, days, and months matched.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YEAR</name>
                  <description>Only seconds, minutes, hours, days, months, and year (offset) matched.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DST_EN</name>
              <description>Daylight Saving Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWR</name>
              <description>Software Reset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEARED</name>
                  <description>Software Reset cleared</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASSERTED</name>
                  <description>Software Reset asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKO_DIS</name>
              <description>Clock Output Disable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TO_OTHER_PERIPHERALS</name>
                  <description>The selected clock is output to other peripherals.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_TO_OTHER_PERIPHERALS</name>
                  <description>The selected clock is not output to other peripherals.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKOUT</name>
              <description>RTC Clock Output Selection</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_OUTPUT_CLK</name>
                  <description>No output clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_1HZ_FINE</name>
                  <description>Fine 1 Hz clock with both precise edges</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_32_168KHZ</name>
                  <description>32.768 kHz clock</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_1HZ_COARSE</name>
                  <description>Coarse 1 Hz clock with both precise edges</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
