Masmiseim36/nxpSDK/devices/MIMXRT798S/MIMXRT798S_cm33_core0.xml
        <register>
          <name>AIPS2_BRIDGE_GROUP0_MEM_RULE1</name>
          <description>AIPS2 Bridge Group 0 Memory Rule Register 1</description>
          <addressOffset>0x514</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x33333333</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OSTIMER_ALIAS1</name>
              <description>OSTIMER ALIAS1 (HIFI4 port)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACMP0</name>
              <description>ACMP0</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC0</name>
              <description>ADC0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDADC</name>
              <description>SDADC</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MICFIL</name>
              <description>MICFIL</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PMC0</name>
              <description>PMC0</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AIPS2_BRIDGE_GROUP1_MEM_RULE0</name>
          <description>AIPS2 Bridge Group 1 Memory Rule Register 0</description>
          <addressOffset>0x520</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3333</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPI2C15</name>
              <description>LPI2C15</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB_SECURE_CTRL_SENSE_RULE0</name>
          <description>Sense Domain AHB Secure Control Peripheral Rule 0</description>
          <addressOffset>0x530</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3333</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RULE0</name>
              <description>Rule 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RULE1</name>
              <description>Rule 1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RULE2</name>
              <description>Rule 2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RULE3</name>
              <description>Rule 3</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MEDIA_AHB_PERIPHERAL_SLAVE_RULE0</name>
          <description>MEDIA domain AHB peripheral slave</description>
          <addressOffset>0x550</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MEDIA_AHB_PERIPHERAL</name>
              <description>MEDIA domain AHB Peripheral Slave Rule Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MEDIA_APB_PERIPHERAL_SLAVE_RULE0</name>
          <description>MEDIA domain APB peripheral slave Rule Register</description>
          <addressOffset>0x560</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MEDIA_APB_PERIPHERAL</name>
              <description>MEDIA domain APB Peripheral Slave</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EZHV_SRAM_RULE0</name>
          <description>EZHV SRAM Memory Rule Register</description>
          <addressOffset>0x570</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EZHV_SRAM</name>
              <description>EZHV SRAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>29</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SEC_VIO_ADDR[%s]</name>
          <description>Security Violation Address</description>
          <addressOffset>0xE00</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEC_VIO_ADDR</name>
              <description>Security violation address for AHB layer a reset value 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
