Masmiseim36/nxpSDK/devices/MIMXRT798S/MIMXRT798S_cm33_core0.xml
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>RESFIFO[%s]</name>
          <description>Data Result FIFO</description>
          <addressOffset>0x300</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>D</name>
              <description>Data Result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TSRC</name>
              <description>Trigger Source</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIGGER_0</name>
                  <description>Trigger source 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER_1</name>
                  <description>Trigger source 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOOPCNT</name>
              <description>Loop Count Value</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESULT_1</name>
                  <description>Initial conversion</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESULT_2</name>
                  <description>Second conversion</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_RESULT_2</name>
                  <description>LOOPCNT + 1 conversion</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_RESULT_3</name>
                  <description>LOOPCNT + 1 conversion</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_RESULT_4</name>
                  <description>LOOPCNT + 1 conversion</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_RESULT_5</name>
                  <description>LOOPCNT + 1 conversion</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_RESULT_6</name>
                  <description>LOOPCNT + 1 conversion</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_RESULT_7</name>
                  <description>LOOPCNT + 1 conversion</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_RESULT_8</name>
                  <description>LOOPCNT + 1 conversion</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_RESULT_9</name>
                  <description>LOOPCNT + 1 conversion</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESULT_16</name>
                  <description>16th conversion</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMDSRC</name>
              <description>Command Buffer Source</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_VALID</name>
                  <description>Not a valid CMDSRC value for a dataword in RESFIFO</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD1</name>
                  <description>CMD1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_CMD_2</name>
                  <description>Corresponding command</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_CMD_3</name>
                  <description>Corresponding command</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_CMD_4</name>
                  <description>Corresponding command</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_CMD_5</name>
                  <description>Corresponding command</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_CMD_6</name>
                  <description>Corresponding command</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_CMD_7</name>
                  <description>Corresponding command</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_CMD_8</name>
                  <description>Corresponding command</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_CMD_9</name>
                  <description>Corresponding command</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD15</name>
                  <description>CMD15</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VALID</name>
              <description>FIFO Entry is Valid</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_VALID</name>
                  <description>Not valid</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>Valid</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>33</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CAL_GAR[%s]</name>
          <description>Calibration General A-Side</description>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CAL_GAR_VAL</name>
              <description>Calibration General A-Side Register Element</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>33</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CAL_GBR[%s]</name>
          <description>Calibration General B-Side</description>
          <addressOffset>0x500</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CAL_GBR_VAL</name>
              <description>Calibration General B-Side Register Element</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG2</name>
          <description>Configuration 2</description>
          <addressOffset>0xFF8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>JLEFT</name>
              <description>Justified Left Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DATA_12b_SE_STD_FORMAT</name>
                  <description>Standard format</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA_12b_SE_LEFT_JUSTIFIED</name>
                  <description>Left-justified format</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
