Masmiseim36/nxpSDK/devices/MIMXRT798S/MIMXRT798S_cm33_core0.xml
        <register>
          <name>DC_CTRL</name>
          <description>MICFIL DC Remover Control</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCCONFIG0</name>
              <description>Channel 0 DC Remover Configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dc_rem_20Hz</name>
                  <description>20 Hz (PDM_CLK = 3.072 MHz)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_13p3Hz</name>
                  <description>13.3 Hz (PDM_CLK = 3.072 MHz)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_40Hz</name>
                  <description>40 Hz (PDM_CLK = 3.072 MHz)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_bypass</name>
                  <description>DC remover is bypassed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCCONFIG1</name>
              <description>Channel 1 DC Remover Configuration</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dc_rem_20Hz</name>
                  <description>20 Hz (PDM_CLK = 3.072 MHz)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_13p3Hz</name>
                  <description>13.3 Hz (PDM_CLK = 3.072 MHz)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_40Hz</name>
                  <description>40 Hz (PDM_CLK = 3.072 MHz)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_bypass</name>
                  <description>DC remover is bypassed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCCONFIG2</name>
              <description>Channel 2 DC Remover Configuration</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dc_rem_20Hz</name>
                  <description>20 Hz (PDM_CLK = 3.072 MHz)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_13p3Hz</name>
                  <description>13.3 Hz (PDM_CLK = 3.072 MHz)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_40Hz</name>
                  <description>40 Hz (PDM_CLK = 3.072 MHz)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_bypass</name>
                  <description>DC remover is bypassed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCCONFIG3</name>
              <description>Channel 3 DC Remover Configuration</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dc_rem_20Hz</name>
                  <description>20 Hz (PDM_CLK = 3.072 MHz)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_13p3Hz</name>
                  <description>13.3 Hz (PDM_CLK = 3.072 MHz)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_40Hz</name>
                  <description>40 Hz (PDM_CLK = 3.072 MHz)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_bypass</name>
                  <description>DC remover is bypassed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCCONFIG4</name>
              <description>Channel 4 DC Remover Configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dc_rem_20Hz</name>
                  <description>20 Hz (PDM_CLK = 3.072 MHz)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_13p3Hz</name>
                  <description>13.3 Hz (PDM_CLK = 3.072 MHz)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_40Hz</name>
                  <description>40 Hz (PDM_CLK = 3.072 MHz)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_bypass</name>
                  <description>DC remover is bypassed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCCONFIG5</name>
              <description>Channel 5 DC Remover Configuration</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dc_rem_20Hz</name>
                  <description>20 Hz (PDM_CLK = 3.072 MHz)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_13p3Hz</name>
                  <description>13.3 Hz (PDM_CLK = 3.072 MHz)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_40Hz</name>
                  <description>40 Hz (PDM_CLK = 3.072 MHz)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_bypass</name>
                  <description>DC remover is bypassed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCCONFIG6</name>
              <description>Channel 6 DC Remover Configuration</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dc_rem_20Hz</name>
                  <description>20 Hz (PDM_CLK = 3.072 MHz)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_13p3Hz</name>
                  <description>13.3 Hz (PDM_CLK = 3.072 MHz)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_40Hz</name>
                  <description>40 Hz (PDM_CLK = 3.072 MHz)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_bypass</name>
                  <description>DC remover is bypassed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCCONFIG7</name>
              <description>Channel 7 DC Remover Configuration</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dc_rem_20Hz</name>
                  <description>20 Hz (PDM_CLK = 3.072 MHz)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_13p3Hz</name>
                  <description>13.3 Hz (PDM_CLK = 3.072 MHz)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_40Hz</name>
                  <description>40 Hz (PDM_CLK = 3.072 MHz)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_bypass</name>
                  <description>DC remover is bypassed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DC_OUT_CTRL</name>
          <description>MICFIL Output DC Remover Control</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCCONFIG0</name>
              <description>Channel 0 DC Remover Configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dc_rem_20Hz</name>
                  <description>20 Hz (FS = 48 kHz)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_13p3Hz</name>
                  <description>13.3 Hz (FS = 48 kHz)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_40Hz</name>
                  <description>40 Hz (FS = 48 kHz)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_bypassed</name>
                  <description>DC remover is bypassed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCCONFIG1</name>
              <description>Channel 1 DC Remover Configuration</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dc_rem_20Hz</name>
                  <description>20 Hz (FS = 48 kHz)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_13p3Hz</name>
                  <description>13.3 Hz (FS = 48 kHz)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_40Hz</name>
                  <description>40 Hz (FS = 48 kHz)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_bypassed</name>
                  <description>DC remover is bypassed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCCONFIG2</name>
              <description>Channel 2 DC Remover Configuration</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dc_rem_20Hz</name>
                  <description>20 Hz (FS = 48 kHz)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_13p3Hz</name>
                  <description>13.3 Hz (FS = 48 kHz)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_40Hz</name>
                  <description>40 Hz (FS = 48 kHz)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_bypassed</name>
                  <description>DC remover is bypassed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCCONFIG3</name>
              <description>Channel 3 DC Remover Configuration</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dc_rem_20Hz</name>
                  <description>20 Hz (FS = 48 kHz)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_13p3Hz</name>
                  <description>13.3 Hz (FS = 48 kHz)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_40Hz</name>
                  <description>40 Hz (FS = 48 kHz)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_bypassed</name>
                  <description>DC remover is bypassed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCCONFIG4</name>
              <description>Channel 4 DC Remover Configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dc_rem_20Hz</name>
                  <description>20 Hz (FS = 48 kHz)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_13p3Hz</name>
                  <description>13.3 Hz (FS = 48 kHz)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_40Hz</name>
                  <description>40 Hz (FS = 48 kHz)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_bypassed</name>
                  <description>DC remover is bypassed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCCONFIG5</name>
              <description>Channel 5 DC Remover Configuration</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dc_rem_20Hz</name>
                  <description>20 Hz (FS = 48 kHz)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_13p3Hz</name>
                  <description>13.3 Hz (FS = 48 kHz)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_40Hz</name>
                  <description>40 Hz (FS = 48 kHz)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_bypassed</name>
                  <description>DC remover is bypassed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCCONFIG6</name>
              <description>Channel 6 DC Remover Configuration</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dc_rem_20Hz</name>
                  <description>20 Hz (FS = 48 kHz)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_13p3Hz</name>
                  <description>13.3 Hz (FS = 48 kHz)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_40Hz</name>
                  <description>40 Hz (FS = 48 kHz)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_bypassed</name>
                  <description>DC remover is bypassed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCCONFIG7</name>
              <description>Channel 7 DC Remover Configuration</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dc_rem_20Hz</name>
                  <description>20 Hz (FS = 48 kHz)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_13p3Hz</name>
                  <description>13.3 Hz (FS = 48 kHz)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_40Hz</name>
                  <description>40 Hz (FS = 48 kHz)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dc_rem_bypassed</name>
                  <description>DC remover is bypassed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RANGE_CTRL</name>
          <description>MICFIL Range Control</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RANGEADJ0</name>
              <description>Channel 0 Range Adjustment</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RANGEADJ1</name>
              <description>Channel 1 Range Adjustment</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RANGEADJ2</name>
              <description>Channel 2 Range Adjustment</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RANGEADJ3</name>
              <description>Channel 3 Range Adjustment</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RANGEADJ4</name>
              <description>Channel 4 Range Adjustment</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RANGEADJ5</name>
              <description>Channel 5 Range Adjustment</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RANGEADJ6</name>
              <description>Channel 6 Range Adjustment</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RANGEADJ7</name>
              <description>Channel 7 Range Adjustment</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
