Masmiseim36/nxpSDK/devices/MIMXRT798S/MIMXRT798S_cm33_core0.xml
        <register>
          <name>FLAGS</name>
          <description>PMC Flags in Compute Domain</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1CF800</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>DSALLF</name>
              <description>Deep Sleep Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEEP_SLEEP_0</name>
                  <description>CPU0 and CPU1 are not in Deep Sleep mode at the same time</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEEP_SLEEP_1</name>
                  <description>CPU0 and CPU1 have both been in Deep Sleep mode at the same time</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ITRCRF</name>
              <description>ITRC RAM ZEROIZE Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ITRC_RAM_ZEROIZE_0</name>
                  <description>Not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ITRC_RAM_ZEROIZE_1</name>
                  <description>ITRC RAM ZEROIZE detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BBSR1EF</name>
              <description>VDD1 SRAM Body Bias Error Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM_BODY_BIAS_ERROR_VDD1_0</name>
                  <description>No SRAM body bias error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM_BODY_BIAS_ERROR_VDD1_1</name>
                  <description>SRAM body bias error detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BBSR2EF</name>
              <description>VDD2 SRAM Body Bias Error Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM_BODY_BIAS_ERROR_VDD2_0</name>
                  <description>No SRAM body bias error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM_BODY_BIAS_ERROR_VDD2_1</name>
                  <description>SRAM body bias error detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BB1EF</name>
              <description>VDD1 Body Bias Error Flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BODY_BIAS_ERROR_VDD1_0</name>
                  <description>No body bias error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BODY_BIAS_ERROR_VDD1_1</name>
                  <description>Body bias error detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BB2EF</name>
              <description>VDD2 Body Bias Error Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BODY_BIAS_ERROR_VDD2_0</name>
                  <description>No body bias error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BODY_BIAS_ERROR_VDD2_1</name>
                  <description>Body bias error detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BBNEF</name>
              <description>VDDN Body Bias Error Flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BODY_BIAS_ERROR_VDDN_0</name>
                  <description>No body bias error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BODY_BIAS_ERROR_VDDN_1</name>
                  <description>Body bias error detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCP1OCF</name>
              <description>SCPC VDD1 Overcurrent Flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SCP_OVER_CURRENT_VDD1_0</name>
                  <description>No overcurrent event detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCP_OVER_CURRENT_VDD1_1</name>
                  <description>Overcurrent event detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCP2OCF</name>
              <description>SCPC VDD2 Overcurrent Flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SCP_OVER_CURRENT_VDD2_0</name>
                  <description>No overcurrent event detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCP_OVER_CURRENT_VDD2_1</name>
                  <description>Overcurrent event detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCHPOCF</name>
              <description>DCDC High-Power Mode Overcurrent Flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCDC_OVER_CURRENT_HP_0</name>
                  <description>No overcurrent event detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCDC_OVER_CURRENT_HP_1</name>
                  <description>Overcurrent event detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCLPOCF</name>
              <description>DCDC Low-Power Mode Overcurrent Flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCDC_OVER_CURRENT_LP_0</name>
                  <description>No overcurrent event detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCDC_OVER_CURRENT_LP_1</name>
                  <description>Overcurrent event detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PORVDD1F</name>
              <description>VDD1 Power-on Reset Flag</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORVDD1F_0</name>
                  <description>POR status cleared</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORVDD1F_1</name>
                  <description>POR status asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PORVDD2F</name>
              <description>VDD2 Power-on Reset Flag</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORVDD2F_0</name>
                  <description>POR status cleared</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORVDD2F_1</name>
                  <description>POR status asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PORVDDNF</name>
              <description>VDDN Power-on Reset Flag</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORVDDNF_0</name>
                  <description>POR status cleared</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORVDDNF_1</name>
                  <description>POR status asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR1V8F</name>
              <description>VDD1V8 Power-on Reset Flag</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR1V8F_0</name>
                  <description>POR status cleared</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR1V8F_1</name>
                  <description>POR status asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PORAO18F</name>
              <description>VDD1V8_AO Power-on Reset Flag</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORAO18F_0</name>
                  <description>POR status cleared</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORAO18F_1</name>
                  <description>POR status asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AGDET1F</name>
              <description>VDD1 Glitch Detector Flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AGDET1F_0</name>
                  <description>Glitch detector status cleared</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGDET1F_1</name>
                  <description>Glitch detector status asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AGDET2F</name>
              <description>VDD2 Glitch Detector Flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AGDET2F_0</name>
                  <description>Glitch detector status cleared</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGDET2F_1</name>
                  <description>Glitch detector status asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LVDVDD1F</name>
              <description>VDD1 Low-Voltage Detector Flag</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LVDVDD1F_0</name>
                  <description>Low-voltage detector status cleared</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVDVDD1F_1</name>
                  <description>Low-voltage detector status asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LVDVDD2F</name>
              <description>VDD2 Low-Voltage Detector Flag</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LVDVDD2F_0</name>
                  <description>Low-voltage detector status cleared</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVDVDD2F_1</name>
                  <description>Low-voltage detector status asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LVDVDDNF</name>
              <description>VDDN Low-Voltage Detector Flag</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LVDVDDNF_0</name>
                  <description>Low-voltage detector status cleared</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVDVDDNF_1</name>
                  <description>Low-voltage detector status asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HVDVDD1F</name>
              <description>VDD1 High-Voltage Detector Flag</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HVDVDD1F_0</name>
                  <description>High-voltage detector status cleared</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HVDVDD1F_1</name>
                  <description>High-voltage detector status asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HVDVDD2F</name>
              <description>VDD2 High-Voltage Detector Flag</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HVDVDD2F_0</name>
                  <description>High-voltage detector status cleared</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HVDVDD2F_1</name>
                  <description>High-voltage detector status asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HVDVDDNF</name>
              <description>VDDN High-Voltage Detector Flag</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HVDVDDNF_0</name>
                  <description>High-voltage detector status cleared</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HVDVDDNF_1</name>
                  <description>High-voltage detector status asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HVD1V8F</name>
              <description>VDD1V8 High-Voltage Detector Flag</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HVD1V8F_0</name>
                  <description>High-voltage detector status cleared</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HVD1V8F_1</name>
                  <description>High-voltage detector status asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTCF</name>
              <description>RTC Flag</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RTCF_0</name>
                  <description>RTC status cleared</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTCF_1</name>
                  <description>RTC status asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUTOWKF</name>
              <description>Auto Wake-up Flag</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUTOWKF_0</name>
                  <description>Auto wake-up status cleared</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUTOWKF_1</name>
                  <description>Auto wake-up status asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTNF</name>
              <description>PMIC_IRQN Interrupt Pin Flag</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTNF_0</name>
                  <description>Interrupt pin status cleared</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTNF_1</name>
