Masmiseim36/nxpSDK/devices/MIMXRT798S/MIMXRT798S_cm33_core0.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>NVIC0</name>
      <description>Nested Vectored Interrupt Controller</description>
      <groupName>NVIC</groupName>
      <baseAddress>0xE000E100</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xE04</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>Reserved16</name>
        <value>0</value>
      </interrupt>
      <interrupt>
        <name>UTICK0</name>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>MRT0</name>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>CTIMER0</name>
        <value>3</value>
      </interrupt>
      <interrupt>
        <name>CTIMER1</name>
        <value>4</value>
      </interrupt>
      <interrupt>
        <name>SCT0</name>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>CTIMER3</name>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>LP_FLEXCOMM0</name>
        <value>7</value>
      </interrupt>
      <interrupt>
        <name>LP_FLEXCOMM1</name>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>LP_FLEXCOMM2</name>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>LP_FLEXCOMM3</name>
        <value>10</value>
      </interrupt>
      <interrupt>
        <name>LP_FLEXCOMM4</name>
        <value>11</value>
      </interrupt>
      <interrupt>
        <name>LP_FLEXCOMM5</name>
        <value>12</value>
      </interrupt>
      <interrupt>
        <name>LPSPI14</name>
        <value>13</value>
      </interrupt>
      <interrupt>
        <name>LPI2C15</name>
        <value>14</value>
      </interrupt>
      <interrupt>
        <name>ADC</name>
        <value>15</value>
      </interrupt>
      <interrupt>
        <name>SDADC</name>
        <value>16</value>
      </interrupt>
      <interrupt>
        <name>ACMP</name>
        <value>17</value>
      </interrupt>
      <interrupt>
        <name>PDM_EVENT</name>
        <value>18</value>
      </interrupt>
      <interrupt>
        <name>PDM_HWVAD_EVENT</name>
        <value>19</value>
      </interrupt>
      <interrupt>
        <name>HYPERVISOR</name>
        <value>20</value>
      </interrupt>
      <interrupt>
        <name>SECURE_VIOLATION</name>
        <value>21</value>
      </interrupt>
      <interrupt>
        <name>SENSE_HYPERVISOR</name>
        <value>22</value>
      </interrupt>
      <interrupt>
        <name>SENSE_SECURE_VIOLATION</name>
        <value>23</value>
      </interrupt>
      <interrupt>
        <name>MEDIA_HYPERVISOR</name>
        <value>24</value>
      </interrupt>
      <interrupt>
        <name>MEDIA_SECURE_VIOLATION</name>
        <value>25</value>
      </interrupt>
      <interrupt>
        <name>RTC0_ALARM</name>
        <value>26</value>
      </interrupt>
      <interrupt>
        <name>RTC0</name>
        <value>27</value>
      </interrupt>
      <interrupt>
        <name>HIFI4</name>
        <value>28</value>
      </interrupt>
      <interrupt>
        <name>MU0_A</name>
        <value>29</value>
      </interrupt>
      <interrupt>
        <name>MU1_A</name>
        <value>30</value>
      </interrupt>
      <interrupt>
        <name>MU4_A</name>
        <value>31</value>
      </interrupt>
      <interrupt>
        <name>CTIMER2</name>
        <value>32</value>
      </interrupt>
      <interrupt>
        <name>CTIMER4</name>
        <value>33</value>
      </interrupt>
      <interrupt>
        <name>OS_EVENT</name>
        <value>34</value>
      </interrupt>
      <interrupt>
        <name>LP_FLEXCOMM6</name>
        <value>35</value>
      </interrupt>
      <interrupt>
        <name>LP_FLEXCOMM7</name>
        <value>36</value>
      </interrupt>
      <interrupt>
        <name>USDHC0</name>
        <value>37</value>
      </interrupt>
      <interrupt>
        <name>USDHC1</name>
        <value>38</value>
      </interrupt>
      <interrupt>
        <name>I3C0</name>
        <value>39</value>
      </interrupt>
      <interrupt>
        <name>USB0</name>
        <value>40</value>
      </interrupt>
      <interrupt>
        <name>USB1</name>
        <value>41</value>
      </interrupt>
      <interrupt>
        <name>WDT0</name>
        <value>42</value>
      </interrupt>
      <interrupt>
        <name>WDT1</name>
        <value>43</value>
      </interrupt>
      <interrupt>
        <name>USBPHY0</name>
        <value>44</value>
      </interrupt>
      <interrupt>
        <name>PUF</name>
        <value>45</value>
      </interrupt>
      <interrupt>
        <name>Reserved62</name>
        <value>46</value>
      </interrupt>
      <interrupt>
        <name>LP_FLEXCOMM8</name>
        <value>47</value>
      </interrupt>
      <interrupt>
        <name>LP_FLEXCOMM9</name>
        <value>48</value>
      </interrupt>
      <interrupt>
        <name>LP_FLEXCOMM10</name>
        <value>49</value>
      </interrupt>
      <interrupt>
        <name>LP_FLEXCOMM11</name>
        <value>50</value>
      </interrupt>
      <interrupt>
        <name>LP_FLEXCOMM12</name>
        <value>51</value>
      </interrupt>
      <interrupt>
        <name>LP_FLEXCOMM13</name>
        <value>52</value>
      </interrupt>
      <interrupt>
        <name>LPSPI16</name>
        <value>53</value>
      </interrupt>
      <interrupt>
        <name>I3C1</name>
        <value>54</value>
      </interrupt>
      <interrupt>
        <name>FLEXIO</name>
        <value>55</value>
      </interrupt>
      <interrupt>
        <name>LCDIF</name>
        <value>56</value>
      </interrupt>
      <interrupt>
        <name>VGPU</name>
        <value>57</value>
      </interrupt>
      <interrupt>
        <name>MIPI</name>
        <value>58</value>
      </interrupt>
      <interrupt>
        <name>EDMA0_CH0</name>
        <value>59</value>
      </interrupt>
      <interrupt>
        <name>EDMA0_CH1</name>
        <value>60</value>
      </interrupt>
      <interrupt>
        <name>EDMA0_CH2</name>
        <value>61</value>
      </interrupt>
      <interrupt>
        <name>EDMA0_CH3</name>
        <value>62</value>
      </interrupt>
      <interrupt>
        <name>EDMA0_CH4</name>
        <value>63</value>
      </interrupt>
      <interrupt>
        <name>EDMA0_CH5</name>
        <value>64</value>
      </interrupt>
      <interrupt>
        <name>EDMA0_CH6</name>
        <value>65</value>
      </interrupt>
      <interrupt>
        <name>EDMA0_CH7</name>
        <value>66</value>
      </interrupt>
      <interrupt>
        <name>EDMA0_CH8</name>
        <value>67</value>
      </interrupt>
      <interrupt>
        <name>EDMA0_CH9</name>
        <value>68</value>
      </interrupt>
      <interrupt>
        <name>EDMA0_CH10</name>
        <value>69</value>
      </interrupt>
      <interrupt>
        <name>EDMA0_CH11</name>
        <value>70</value>
      </interrupt>
      <interrupt>
        <name>EDMA0_CH12</name>
        <value>71</value>
      </interrupt>
      <interrupt>
        <name>EDMA0_CH13</name>
        <value>72</value>
      </interrupt>
      <interrupt>
        <name>EDMA0_CH14</name>
        <value>73</value>
      </interrupt>
      <interrupt>
        <name>EDMA0_CH15</name>
        <value>74</value>
      </interrupt>
      <interrupt>
        <name>EDMA1_CH0</name>
        <value>75</value>
      </interrupt>
      <interrupt>
        <name>EDMA1_CH1</name>
        <value>76</value>
      </interrupt>
      <interrupt>
        <name>EDMA1_CH2</name>
        <value>77</value>
      </interrupt>
      <interrupt>
        <name>EDMA1_CH3</name>
        <value>78</value>
      </interrupt>
      <interrupt>
        <name>EDMA1_CH4</name>
        <value>79</value>
      </interrupt>
      <interrupt>
        <name>EDMA1_CH5</name>
        <value>80</value>
      </interrupt>
      <interrupt>
        <name>EDMA1_CH6</name>
        <value>81</value>
      </interrupt>
      <interrupt>
        <name>EDMA1_CH7</name>
        <value>82</value>
      </interrupt>
      <interrupt>
        <name>EDMA1_CH8</name>
        <value>83</value>
      </interrupt>
      <interrupt>
        <name>EDMA1_CH9</name>
        <value>84</value>
      </interrupt>
      <interrupt>
        <name>EDMA1_CH10</name>
        <value>85</value>
      </interrupt>
      <interrupt>
        <name>EDMA1_CH11</name>
        <value>86</value>
      </interrupt>
      <interrupt>
        <name>EDMA1_CH12</name>
        <value>87</value>
      </interrupt>
      <interrupt>
        <name>EDMA1_CH13</name>
        <value>88</value>
      </interrupt>
      <interrupt>
        <name>EDMA1_CH14</name>
        <value>89</value>
      </interrupt>
      <interrupt>
        <name>EDMA1_CH15</name>
        <value>90</value>
      </interrupt>
      <interrupt>
        <name>GPIO00</name>
        <value>91</value>
      </interrupt>
      <interrupt>
        <name>GPIO01</name>
        <value>92</value>
      </interrupt>
      <interrupt>
        <name>GPIO10</name>
        <value>93</value>
      </interrupt>
      <interrupt>
        <name>GPIO11</name>
        <value>94</value>
      </interrupt>
      <interrupt>
        <name>GPIO20</name>
        <value>95</value>
      </interrupt>
      <interrupt>
        <name>GPIO21</name>
        <value>96</value>
      </interrupt>
      <interrupt>
        <name>GPIO30</name>
        <value>97</value>
      </interrupt>
      <interrupt>
        <name>GPIO31</name>
        <value>98</value>
      </interrupt>
      <interrupt>
        <name>GPIO40</name>
        <value>99</value>
      </interrupt>
      <interrupt>
        <name>GPIO41</name>
        <value>100</value>
      </interrupt>
      <interrupt>
        <name>GPIO50</name>
        <value>101</value>
      </interrupt>
      <interrupt>
        <name>GPIO51</name>
        <value>102</value>
      </interrupt>
      <interrupt>
        <name>GPIO60</name>
        <value>103</value>
      </interrupt>
      <interrupt>
        <name>GPIO61</name>
        <value>104</value>
      </interrupt>
      <interrupt>
        <name>GPIO70</name>
        <value>105</value>
      </interrupt>
      <interrupt>
        <name>GPIO71</name>
        <value>106</value>
      </interrupt>
      <interrupt>
        <name>PIN_INT0</name>
        <value>107</value>
      </interrupt>
      <interrupt>
        <name>PIN_INT1</name>
        <value>108</value>
      </interrupt>
      <interrupt>
        <name>PIN_INT2</name>
        <value>109</value>
      </interrupt>
      <interrupt>
        <name>PIN_INT3</name>
        <value>110</value>
      </interrupt>
      <interrupt>
        <name>PIN_INT4</name>
        <value>111</value>
      </interrupt>
      <interrupt>
        <name>PIN_INT5</name>
        <value>112</value>
      </interrupt>
      <interrupt>
        <name>PIN_INT6</name>
        <value>113</value>
      </interrupt>
      <interrupt>
        <name>PIN_INT7</name>
        <value>114</value>
      </interrupt>
      <interrupt>
        <name>SAI0</name>
        <value>115</value>
      </interrupt>
      <interrupt>
        <name>SAI1</name>
        <value>116</value>
      </interrupt>
      <interrupt>
        <name>SAI2</name>
        <value>117</value>
      </interrupt>
      <interrupt>
        <name>XSPI0</name>
        <value>118</value>
      </interrupt>
      <interrupt>
        <name>XSPI1</name>
        <value>119</value>
      </interrupt>
      <interrupt>
        <name>XSPI2</name>
        <value>120</value>
      </interrupt>
      <interrupt>
        <name>MMU0</name>
        <value>121</value>
      </interrupt>
      <interrupt>
        <name>MMU1</name>
        <value>122</value>
      </interrupt>
      <interrupt>
        <name>MMU2</name>
        <value>123</value>
      </interrupt>
      <interrupt>
        <name>Freqme</name>
        <value>124</value>
      </interrupt>
      <interrupt>
        <name>GDET0</name>
        <value>125</value>
      </interrupt>
      <interrupt>
        <name>GDET3</name>
        <value>128</value>
      </interrupt>
      <interrupt>
        <name>CDOG0</name>
        <value>129</value>
      </interrupt>
      <interrupt>
        <name>CDOG1</name>
        <value>130</value>
      </interrupt>
      <interrupt>
        <name>CDOG2</name>
        <value>131</value>
      </interrupt>
      <interrupt>
        <name>ITRC0</name>
        <value>132</value>
      </interrupt>
      <interrupt>
        <name>ELS</name>
        <value>133</value>
      </interrupt>
      <interrupt>
        <name>PKC</name>
        <value>134</value>
      </interrupt>
      <interrupt>
        <name>OSCCA</name>
        <value>135</value>
      </interrupt>
      <interrupt>
        <name>SLEEPCON0</name>
        <value>136</value>
      </interrupt>
      <interrupt>
        <name>CPU0</name>
        <value>137</value>
      </interrupt>
      <interrupt>
        <name>PMC</name>
        <value>138</value>
      </interrupt>
      <interrupt>
        <name>JPEGDEC</name>
        <value>139</value>
      </interrupt>
      <interrupt>
        <name>PNGDEC</name>
        <value>140</value>
      </interrupt>
      <interrupt>
        <name>NPU</name>
        <value>141</value>
      </interrupt>
      <interrupt>
        <name>TRNG</name>
        <value>142</value>
      </interrupt>
      <interrupt>
        <name>TEMPDET0</name>
        <value>143</value>
      </interrupt>
      <interrupt>
        <name>TEMPDET1</name>
        <value>144</value>
      </interrupt>
      <interrupt>
        <name>EZHV</name>
        <value>145</value>
      </interrupt>
      <interrupt>
        <name>GLIKEY0</name>
        <value>146</value>
      </interrupt>
      <interrupt>
        <name>GLIKEY2</name>
        <value>147</value>
      </interrupt>
      <interrupt>
        <name>GLIKEY3</name>
        <value>148</value>
      </interrupt>
      <interrupt>
        <name>GLIKEY5</name>
        <value>149</value>
      </interrupt>
      <interrupt>
        <name>PVTS0_CPU0</name>
        <value>150</value>
      </interrupt>
      <interrupt>
        <name>Reserved167</name>
        <value>151</value>
      </interrupt>
      <interrupt>
        <name>PVTS0_HIFI4</name>
        <value>152</value>
      </interrupt>
      <interrupt>
        <name>Reserved169</name>
        <value>153</value>
      </interrupt>
      <interrupt>
        <name>FRO0</name>
        <value>154</value>
      </interrupt>
      <interrupt>
        <name>FRO1</name>
        <value>155</value>
      </interrupt>
      <interrupt>
        <name>FRO2</name>
        <value>156</value>
      </interrupt>
      <interrupt>
        <name>OCOTP</name>
        <value>157</value>
      </interrupt>
      <registers>
        <register>
          <dim>16</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>ISER[%s]</name>
          <description>Interrupt Set Enable Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SETENA0</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA1</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA2</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA3</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA4</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA5</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA6</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA7</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA8</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA9</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA10</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
